src/main/assets/intents.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/style.css" />


</head>
<body>
<div id="content">
<h1 class="title"></h1>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Simpletask supports a couple of intents which can be used by other applications (e.g. tasker) to create tasks or display lists.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Create task in background</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To create a task in the background, so without showing simpletask, you can use the intent:
</p>

<ul class="org-ul">
<li>Intent action: <code>nl.mpcjanssen.simpletask.BACKGROUND_TASK</code>
</li>
<li>Intent string extra: <code>task</code>
</li>
</ul>

<p>
the intent will have one extra string <code>task</code> which contains the task to be added.
</p>

<p>
For example to create a task from tasker use the following action:
</p>

<ul class="org-ul">
<li>Action: <code>nl.mpcjanssen.simpletask.BACKGROUND_TASK</code>
</li>
<li>Cat: Default
</li>
<li>Mime Type: text/*
</li>
<li>Extra: task: <code>&lt;Task text with possible variables here&gt; +tasker</code>
</li>
<li>Target: Activity
</li>
</ul>

<p>
I like to add the <code>+tasker</code> tag to be able to quickly filter tasks that were created by tasker.
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Open with specific filter</h3>
<div class="outline-text-3" id="text-1-2">
<p>
To open Simpletask with a specific filter you can use the intent:
</p>


<ul class="org-ul">
<li>Intent action: <code>nl.mpcjanssen.simpletask.START_WITH_FILTER</code>
</li>
<li>Intent extras: The following extras can be added as part of the
intent. Note that currently the names still reflect the original
naming of lists/tags.
</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">Name</th>
<th scope="col" class="left">Type</th>
<th scope="col" class="left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">CONTEXTS</td>
<td class="left">String</td>
<td class="left">list of lists in filter separated by '\n' or ','</td>
</tr>

<tr>
<td class="left">PROJECTS</td>
<td class="left">String</td>
<td class="left">list of tags in filter separated by '\n' or ','</td>
</tr>

<tr>
<td class="left">PRIORITIES</td>
<td class="left">String</td>
<td class="left">list of priorities in filter separated by '\n' or ',</td>
</tr>

<tr>
<td class="left">CONTEXTSnot</td>
<td class="left">Boolean</td>
<td class="left">true to invert the lists filter</td>
</tr>

<tr>
<td class="left">PROJECTSnot</td>
<td class="left">Boolean</td>
<td class="left">true to invert the tags filter</td>
</tr>

<tr>
<td class="left">PRIORITIESnot</td>
<td class="left">Boolean</td>
<td class="left">true to invert the priorities filter</td>
</tr>

<tr>
<td class="left">HIDECOMPLETED</td>
<td class="left">Boolean</td>
<td class="left">true to hide completed tasks</td>
</tr>

<tr>
<td class="left">HIDEFUTURE</td>
<td class="left">Boolean</td>
<td class="left">true to hide tasks with a threshold date</td>
</tr>

<tr>
<td class="left">SORTS</td>
<td class="left">String</td>
<td class="left">active sort (see below)</td>
</tr>
</tbody>
</table>
</div>


<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">Sorts extra</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
SORTS contains a comma or '\n' separated list of sort keys and their
direction with a <code>!</code> in between. Giving <code>&lt;direction&gt;!&lt;sort key&gt;</code>.
</p>
</div>

<div id="outline-container-sec-1-2-1-1" class="outline-5">
<h5 id="sec-1-2-1-1">Direction</h5>
<div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li><code>+</code> : Ascending
</li>
<li><code>-</code> : Descending
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2-1-2" class="outline-5">
<h5 id="sec-1-2-1-2">Sort keys</h5>
<div class="outline-text-5" id="text-1-2-1-2">
<p>
See list in <a href="http://mpcjanssen.nl/fossil/simpletask/artifact/ac6b9bf579b8d1a9c23083031852a0fdd81efb75?ln=42-51">http://mpcjanssen.nl/fossil/simpletask/artifact/ac6b9bf579b8d1a9c23083031852a0fdd81efb75?ln=42-51</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-2-1-3" class="outline-5">
<h5 id="sec-1-2-1-3">Example</h5>
<div class="outline-text-5" id="text-1-2-1-3">
<ul class="org-ul">
<li>The sort <code>+!completed,+!alphabetical</code> sorts completed tasks last and then sorts alphabetical.
</li>
<li>The sort <code>+!completed,-!alphabetical</code> sorts completed tasks last and
then sorts reversed alphabetical.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">Tasker example</h4>
<div class="outline-text-4" id="text-1-2-2">
<ul class="org-ul">
<li>Action: <code>nl.mpcjanssen.simpletask.START_WITH_FILTER</code>
</li>
<li>Cat: <code>Default</code>
</li>
<li>Mime Type:
</li>
<li>Extra: <code>CONTEXTS:Office,Online</code>
</li>
<li>Extra: <code>SORTS:+!completed,+!alphabetical</code>
</li>
<li>Target: <code>Activity</code>
</li>
</ul>

<p>
Due to limitations in Tasker you can only add 2 extras. So instead you can use the am shell command. For example:
</p>

<pre class="example">
am start -a nl.mpcjanssen.simpletask.START_WITH_FILTER -e SORTS +!completed,+!alphabetical -e PROJECTS project1,project2 -e CONTEXTS @errands,@computer --ez CONTEXTSnot true -c android.intent.category.DEFAULT -S
</pre>

<p>
The <code>-S</code> at the end will ensure the app is properly restarted if it's
already visible. However with tasker the <code>-S</code> seems not to work. So there try it without.
</p>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
